In [51]:
import pandas as pd

In [5]:
pd.__version__

'0.23.4'

In [8]:
ser = pd.Series([1,2,3])

In [10]:
ser

0    1
1    2
2    3
dtype: int64

In [12]:
ser + ser

0    2
1    4
2    6
dtype: int64

In [13]:
df = pd.DataFrame(ser)

In [15]:
df

   0
0  1
1  2
2  3

In [18]:
df[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [19]:
df.iloc[0]

0    1
Name: 0, dtype: int64

In [20]:
df.iloc[0,0]

1

In [22]:
df[0][0]

1

In [27]:
df = pd.DataFrame(data=[[0,1,2],[3,4,5]], index=list('ab'), columns=list('cde'))
df

   c  d  e
a  0  1  2
b  3  4  5

In [28]:
type(df.index)

pandas.core.indexes.base.Index

In [29]:
type(df.columns)

pandas.core.indexes.base.Index

In [30]:
type(df.values)

numpy.ndarray

In [31]:
type(df.iloc)

pandas.core.indexing._iLocIndexer

In [32]:
type(df.loc)

pandas.core.indexing._LocIndexer

In [35]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=list('abc'))
df_a=df
df_a['a']=100
df_a

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [36]:
df

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [37]:
id(df), id(df_a)

(1519020798472, 1519020798472)

In [38]:
df.values.base is df_a.values.base

True

In [42]:
df_b = df_a + 99
df_b

     a    b    c
0  199  101  102
1  199  104  105
2  199  107  108

In [43]:
id(df_a), id(df_b)

(1519020798472, 1519012092560)

In [44]:
df_a.values.base is df_b.values.base

False

In [45]:
df_a

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [3]:
import numpy as np
import pandas as pd

In [5]:
s1 = pd.Series(index=list('abcd'), data=np.arange(4))

In [6]:
s2 = s1

In [7]:
s1 is s2

True

In [8]:
s3 = s1.copy()
s1 is s3

False

In [9]:
pd.Series.__getitem__

In [10]:
pd.DataFrame.__getitem__

In [11]:
pd.Index.__getitem__

In [12]:
pd.MultiIndex.__getitem__

In [15]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8]], index=['a','b'], columns=['가','나','다','라'])

In [17]:
df.loc.__getitem__

In [18]:
df.iloc.__getitem__

In [19]:
df

   가  나  다  라
a  1  2  3  4
b  5  6  7  8

In [20]:
df['나']

a    2
b    6
Name: 나, dtype: int64

In [21]:
df.__getitem__('나')

a    2
b    6
Name: 나, dtype: int64

In [22]:
ser = df['나']

In [23]:
ser

a    2
b    6
Name: 나, dtype: int64

In [24]:
ser['a']

2

In [25]:
ser.__getitem__('a')

2

In [26]:
ser.__getitem__(ser > 3)

b    6
Name: 나, dtype: int64

In [31]:
df.__getitem__(df > 3)

     가    나    다  라
a  NaN  NaN  NaN  4
b  5.0  6.0  7.0  8

In [29]:
df

   가  나  다  라
a  1  2  3  4
b  5  6  7  8

In [33]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=list('abc'))

In [34]:
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [35]:
df1 = pd.DataFrame([[3,3,3],[3,3,3], [3,3,3]],  columns=list('abc'))

In [36]:
df1

   a  b  c
0  3  3  3
1  3  3  3
2  3  3  3

In [37]:
df+3

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [38]:
df + df1

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [39]:
type(df.__add__)

method

In [40]:
type(df.__add__.__func__)

function

In [41]:
type(df.add)

method

In [42]:
type(df.add.__func__)

function

In [44]:
df.__add__.__func__ is df.add.__func__

False

In [45]:
import numpy as np

In [46]:
df_na = pd.DataFrame([1,2,np.nan])

In [47]:
df_na

     0
0  1.0
1  2.0
2  NaN

In [48]:
df_na.sum()

0    3.0
dtype: float64

In [50]:
df_na.sum(skipna=False)

0   NaN
dtype: float64

In [51]:
df_na < 3

       0
0   True
1   True
2  False

In [52]:
df_na < np.nan

       0
0  False
1  False
2  False

In [2]:
import pandas as pd
df_sax = pd.Series([1,2,3,4])

In [3]:
df_sax

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
df_sax.sum(axis=0)

10

In [7]:
df_sax = pd.DataFrame([[1,2,3,4],[5,6,7,8]])
df_sax

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [8]:
df_sax.sum(axis=0)

0     6
1     8
2    10
3    12
dtype: int64

In [9]:
df_sax.sum(axis=1)

0    10
1    26
dtype: int64

In [13]:
import numpy as np
import pandas as pd
df_1 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('ABC'))

In [14]:
df_1

   A  B  C
0  6  9  5
1  8  4  1
2  6  8  4

In [15]:
df_2 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('CAB'))
df_2

   C  A  B
0  1  4  4
1  3  4  9
2  8  8  4

In [17]:
np.log(df_2)

          C         A         B
0  0.000000  1.386294  1.386294
1  1.098612  1.386294  2.197225
2  2.079442  2.079442  1.386294

In [18]:
df_1 + df_2

    A   B   C
0  10  13   6
1  12  13   4
2  14  12  12

In [20]:
df_3 = pd.DataFrame(np.random.randint(1,10,(3,2)),columns=list('CB'))
df_3

   C  B
0  3  1
1  7  9
2  5  1

In [21]:
df_1 + df_3

    A   B  C
0 NaN  10  8
1 NaN  13  8
2 NaN   9  9

In [22]:
!pip install chardet

Requirement already satisfied: chardet in c:\users\04869\appdata\local\continuum\anaconda3\lib\site-packages (3.0.4)

twisted 18.7.0 requires PyHamcrest>=1.9.0, which is not installed.
You are using pip version 10.0.1, however version 18.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [4]:
def find_encoding(fname):
    r_file = open(fname, 'rb').read()
    result = chardet.detect(r_file)
    charenc = result['encoding']
    return charenc

In [6]:
my_encoding1 = find_encoding('../data/weight_loss.csv')
df_1 = pd.read_csv('../data/weight_loss.csv', encoding=my_encoding1)

NameError: name 'chardet' is not defined

In [7]:
my_encoding1

NameError: name 'my_encoding1' is not defined

In [8]:
try:
    pd.read_csv('../data/weight_loss.csv', encoding="utf-8")
except Exception as a :
    print(e)

NameError: name 'e' is not defined

In [9]:
df_1.head()

NameError: name 'df_1' is not defined

In [2]:
import pandas as pd
sr = pd.Series([1,2,3,4],index=list('abcd'),name="SR1")
sr

a    1
b    2
c    3
d    4
Name: SR1, dtype: int64

In [3]:
sr.name

'SR1'

In [4]:
sr.dtype

dtype('int64')

In [5]:
sr.shape

(4,)

In [6]:
sr.ndim

1

In [7]:
sr.size

4

In [8]:
sr.strides

C:\Users\04869\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Series.strides is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

(8,)

In [9]:
sr.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8]], index=['a','b'], columns=['c1','c2','c3','c4'])
df

   c1  c2  c3  c4
a   1   2   3   4
b   5   6   7   8

In [11]:
df.shape

(2, 4)

In [12]:
df.ndim

2

In [13]:
df.size

8

In [14]:
df.index

Index(['a', 'b'], dtype='object')

In [15]:
df.columns

Index(['c1', 'c2', 'c3', 'c4'], dtype='object')

In [16]:
df.info

<bound method DataFrame.info of    c1  c2  c3  c4
a   1   2   3   4
b   5   6   7   8>

In [3]:
import pandas as pd
s = set([ i for i in dir(pd.Series) if not i.startswith("_")])
s

{'T',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'as_blocks',
 'as_matrix',
 'asfreq',
 'asobject',
 'asof',
 'astype',
 'at',
 'at_time',
 'autocorr',
 'axes',
 'base',
 'between',
 'between_time',
 'bfill',
 'blocks',
 'bool',
 'cat',
 'clip',
 'clip_lower',
 'clip_upper',
 'combine',
 'combine_first',
 'compound',
 'compress',
 'consolidate',
 'convert_objects',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'data',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'dropna',
 'dt',
 'dtype',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'from_array',
 'from_csv',
 'ftype',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_value',
 'get_values',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'imag',
 'index',
 'infer_objects',
 'interpolate',
 'is_copy',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'itemsize',
 'iteritems',
 'ix',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'nonzero',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'ptp',
 'put',
 'quantile',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'real',
 'reindex',
 'reindex_axis',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'select',
 'sem',
 'set_axis',
 'set_value',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'sortlevel',
 'squeeze',
 'std',
 'str',
 'strides',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_msgpack',
 'to_period',
 'to_pickle',
 'to_sparse',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'tolist',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'valid',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs'}

In [4]:
import pandas as pd
d = set([ i for i in dir(pd.DataFrame) if not i.startswith("_")])
d

{'T',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'as_blocks',
 'as_matrix',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'axes',
 'between_time',
 'bfill',
 'blocks',
 'bool',
 'boxplot',
 'clip',
 'clip_lower',
 'clip_upper',
 'columns',
 'combine',
 'combine_first',
 'compound',
 'consolidate',
 'convert_objects',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_csv',
 'from_dict',
 'from_items',
 'from_records',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_value',
 'get_values',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'is_copy',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'ix',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_axis',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_index',
 'set_value',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'sortlevel',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_msgpack',
 'to_panel',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sparse',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs'}

In [5]:
count = 0
for i in(s-d) :
    count += 1
    print(i, end=", ")
    if (count %4 == 0) :
        print()

between, argmin, item, view,
data, asobject, from_array, is_monotonic,
dtype, is_monotonic_increasing, nbytes, imag,
compress, value_counts, valid, is_unique,
ptp, itemsize, base, is_monotonic_decreasing,
strides, hasnans, repeat, dt,
map, searchsorted, cat, to_frame,
real, name, argmax, ftype,
factorize, nonzero, tolist, autocorr,
flags, str, divmod, argsort,
ravel, unique, put,

In [6]:
count = 0
for i in(d & s) :
    count += 1
    print(i, end=", ")
    if (count %8 == 0) :
        print()

resample, clip_upper, gt, get_values, cummin, sample, ix, tz_convert,
to_sparse, count, duplicated, shift, sum, eq, skew, set_value,
expanding, any, min, size, to_string, clip_lower, diff, keys,
reindex, first_valid_index, ftypes, cov, equals, select, to_msgpack, apply,
ewm, blocks, compound, radd, subtract, last_valid_index, isin, sort_index,
rdiv, abs, iat, shape, transform, first, all, ffill,
transpose, add_prefix, dot, aggregate, max, take, rename_axis, ndim,
update, truediv, slice_shift, astype, agg, values, kurtosis, is_copy,
asof, idxmin, mode, squeeze, nsmallest, prod, mul, to_pickle,
multiply, sub, tz_localize, lt, reorder_levels, pow, interpolate, ge,
combine, replace, div, le, memory_usage, rmul, empty, sortlevel,
rtruediv, as_blocks, rolling, iloc, corr, std, to_excel, mask,
to_hdf, rank, drop, to_clipboard, floordiv, reindex_like, kurt, to_xarray,
axes, to_period, sort_values, between_time, combine_first, clip, to_sql, notnull,
filter, dtypes, groupby, nunique, rmod, reset_index, at, fillna,
cumsum, get_dtype_counts, hist, nlargest, mean, var, idxmax, pct_change,
drop_duplicates, get_value, to_csv, xs, at_time, head, items, to_dict,
cumprod, divide, unstack, mod, convert_objects, tshift, as_matrix, isna,
index, to_timestamp, round, dropna, get_ftype_counts, describe, rpow, add_suffix,
bool, swaplevel, to_json, append, bfill, add, pop, from_csv,
loc, rsub, consolidate, ne, plot, copy, infer_objects, last,
get, pipe, set_axis, to_dense, T, mad, sem, to_latex,
quantile, reindex_axis, rfloordiv, truncate, swapaxes, where, product, rename,
tail, cummax, median, iteritems, asfreq, isnull, notna, align,

In [7]:
import pandas as pd
obj = pd.Series([1,2,3,4])
obj

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
obj.data.obj

C:\Users\04869\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Series.data is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

array([1, 2, 3, 4], dtype=int64)

In [9]:
obj.data

C:\Users\04869\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Series.data is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

In [10]:
obj.values

array([1, 2, 3, 4], dtype=int64)

In [11]:
obj.dtype

dtype('int64')

In [12]:
d = {'a':1, 'b':2, 'c':3}
ser = pd.Series(d, name='something')
ser

a    1
b    2
c    3
Name: something, dtype: int64

In [14]:
index = ['a', 'b', 'c']
obj1 = pd.Series([1,2,3], index=index, name='test')
obj1

a    1
b    2
c    3
Name: test, dtype: int64

In [2]:
import pandas as pd
s1 = pd.Series([1,2,3,4], name ='s1')
s2 = pd.Series(['a','b','c','d'], name ='s2')
df = pd.DataFrame({'s1': s1, 's2':s2})
df

   s1 s2
0   1  a
1   2  b
2   3  c
3   4  d

In [3]:
df['s1']

0    1
1    2
2    3
3    4
Name: s1, dtype: int64

In [4]:
s1 == df['s1']

0    True
1    True
2    True
3    True
Name: s1, dtype: bool

In [5]:
df_a = pd.DataFrame([s1, s2])
df_a

    0  1  2  3
s1  1  2  3  4
s2  a  b  c  d

In [6]:
data = {'AAA' : {'a': 4, 'b': 5, 'c': 6, 'd': 7},
       'BBB' : {'a': 10, 'b': 20, 'c': 30, 'd': 40},
       'CCC' : {'a': 100, 'b': 50, 'c': -30, 'd': -50},}
df = pd.DataFrame(data)
df

   AAA  BBB  CCC
a    4   10  100
b    5   20   50
c    6   30  -30
d    7   40  -50

In [8]:
df2 = pd.DataFrame(data, columns=['AAA','CCC'])
df2

   AAA  CCC
a    4  100
b    5   50
c    6  -30
d    7  -50

In [10]:
names = ['Bob', 'Jessica','Mary','John','Mel']
births = [968,155,77,578,973]
BabyDataSet = list(zip(names, births))
BabyDataSet

[('Bob', 968), ('Jessica', 155), ('Mary', 77), ('John', 578), ('Mel', 973)]

In [12]:
df = pd.DataFrame(data = BabyDataSet, columns=['Names','Births'])
df.values

array([['Bob', 968],
       ['Jessica', 155],
       ['Mary', 77],
       ['John', 578],
       ['Mel', 973]], dtype=object)

In [13]:
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['Names', 'Births'], dtype='object')]

In [14]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [15]:
df.columns

Index(['Names', 'Births'], dtype='object')

In [16]:
df.shape, df.ndim, df.size

((5, 2), 2, 10)

In [20]:
import pandas as pd
ct = pd.read_csv("2017_college_tuition.csv", encoding='euc-kr')
ct.head()

         학교명 설립구분  평균등록금
0    강릉원주대학교  국공립   4262
1      강원대학교  국공립   4116
2  경남과학기술대학교  국공립   3771
3      경북대학교  국공립   4351
4      경상대학교  국공립   3967

In [21]:
ct.head()

         학교명 설립구분  평균등록금
0    강릉원주대학교  국공립   4262
1      강원대학교  국공립   4116
2  경남과학기술대학교  국공립   3771
3      경북대학교  국공립   4351
4      경상대학교  국공립   3967

In [22]:
ct.tail()

         학교명 설립구분  평균등록금
191    호남대학교   사립   6482
192  호남신학대학교   사립   6438
193    호서대학교   사립   7695
194    호원대학교   사립   6929
195    홍익대학교   사립   8297

In [23]:
ct.shape

(196, 3)

In [24]:
ct.columns

Index(['학교명', '설립구분', '평균등록금'], dtype='object')

In [25]:
ct_ser = ct['학교명']
ct_ser.head()

0      강릉원주대학교
1        강원대학교
2    경남과학기술대학교
3        경북대학교
4        경상대학교
Name: 학교명, dtype: object

In [26]:
ct_ser[100]

'부산장신대학교'

In [27]:
ct_ser.__getitem__(100)

'부산장신대학교'

In [32]:
ct_ser.__getitem__('학교명').head()

KeyError: '학교명'

In [ ]:
ct_ser[10:20]

In [ ]:
ct_slice = ct_ser[10:20]
ct_slice.head()

In [ ]:
ct_slice.shape

In [ ]:
ct.__getitem__(slice(10,20)).head()

In [43]:
import pandas as pd
sat = pd.read_csv("C:/Users/04869/Downloads/Pandas Study/data/2014_korea_sat_scores.csv", encoding='euc-kr').dropna(axis=1)

In [44]:
sat.head()

   등급     과목 구분점수  도수(명)  비율(%)
0   1  국어 A형  128  13866   4.30
1   2  국어 A형  123  23599   7.32
2   3  국어 A형  116  42470  13.17
3   4  국어 A형  108  52640  16.32
4   5  국어 A형   97  63896  19.81

In [48]:
import numpy as np
sat['도수(명)'] = sat['도수(명)'].astype(np.int64)

In [46]:
sat['도수(명)'].dtype

dtype('int64')

In [47]:
(sat['도수(명)'] < 20000).head()

0     True
1    False
2    False
3    False
4    False
Name: 도수(명), dtype: bool

In [49]:
sat[sat['도수(명)']<20000].head()

    등급     과목  구분점수  도수(명)  비율(%)
0    1  국어 A형   128  13866   4.30
8    9  국어 A형  60미만  12554   3.89
9    1  국어 B형   127  12615   4.45
16   8  국어 B형    59  19943   7.03
17   9  국어 B형  59미만  10868   3.83

In [5]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [6]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [8]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [9]:
titanic[ ['age','sex','alive']].head()

    age     sex alive
0  22.0    male    no
1  38.0  female   yes
2  26.0  female   yes
3  35.0  female   yes
4  35.0    male    no

In [10]:
titanic[['age','sex','alive']].isnull().sum()

age      177
sex        0
alive      0
dtype: int64

In [11]:
titanic['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [7]:
titanic[['age']].head()

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [8]:
titanic_age = titanic['age']

In [9]:
titanic_age[[0,3,4]]

0    22.0
3    35.0
4    35.0
Name: age, dtype: float64

In [10]:
import seaborn as sns
diamonds = sns.load_dataset('diamonds')
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [11]:
diamonds.tail()

       carat        cut color clarity  depth  table  price     x     y     z
53935   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53936   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53937   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
53938   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
53939   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

In [12]:
diamonds.shape

(53940, 10)

In [13]:
diamonds.isnull().sum()

carat      0
cut        0
color      0
clarity    0
depth      0
table      0
price      0
x          0
y          0
z          0
dtype: int64

In [14]:
type(diamonds.loc)

pandas.core.indexing._LocIndexer

In [15]:
diamonds.loc[0]

carat       0.23
cut        Ideal
color          E
clarity      SI2
depth       61.5
table         55
price        326
x           3.95
y           3.98
z           2.43
Name: 0, dtype: object

In [16]:
diamonds.loc[0, 'carat']

0.23

In [17]:
diamonds.loc[:, 'carat'].head()

0    0.23
1    0.21
2    0.23
3    0.29
4    0.31
Name: carat, dtype: float64

In [19]:
diamonds['carat'].head()

0    0.23
1    0.21
2    0.23
3    0.29
4    0.31
Name: carat, dtype: float64

In [21]:
diamonds.loc[:, ['carat']].head()

   carat
0   0.23
1   0.21
2   0.23
3   0.29
4   0.31

In [23]:
diamonds[['carat']].head()

   carat
0   0.23
1   0.21
2   0.23
3   0.29
4   0.31

In [24]:
diamonds.xs(0)

carat       0.23
cut        Ideal
color          E
clarity      SI2
depth       61.5
table         55
price        326
x           3.95
y           3.98
z           2.43
Name: 0, dtype: object

In [25]:
diamonds.xs("carat",1).head()

0    0.23
1    0.21
2    0.23
3    0.29
4    0.31
Name: carat, dtype: float64

In [31]:
diamonds.lookup([0,4],['carat','cut'])

array([0.23, 'Good'], dtype=object)

In [32]:
diamonds.iloc[0,[0,1,2,]]

carat     0.23
cut      Ideal
color        E
Name: 0, dtype: object

In [33]:
diamonds.iloc[:5, :3]

   carat      cut color
0   0.23    Ideal     E
1   0.21  Premium     E
2   0.23     Good     E
3   0.29  Premium     I
4   0.31     Good     J

In [34]:
diamonds.columns

Index(['carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price', 'x', 'y',
       'z'],
      dtype='object')

In [37]:
((diamonds['carat'] == 0.23) & (diamonds['cut'] == 'Very Good')).head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [41]:
carat_cut = diamonds.loc[((diamonds['carat']==0.23)&(diamonds['cut']=='Very Good')), ['carat', 'cut', 'color', 'price']]

In [42]:
carat_cut.shape

(197, 4)

In [43]:
carat_cut.head()

    carat        cut color  price
9    0.23  Very Good     H    338
21   0.23  Very Good     E    352
22   0.23  Very Good     H    353
25   0.23  Very Good     G    354
28   0.23  Very Good     D    357

In [44]:
diamonds.loc[:, ['carat', 'cut', 'color', 'price']].head()

   carat      cut color  price
0   0.23    Ideal     E    326
1   0.21  Premium     E    326
2   0.23     Good     E    327
3   0.29  Premium     I    334
4   0.31     Good     J    335

In [46]:
diamonds.loc._get_slice_axis(slice(0,len(diamonds))).head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [2]:
import seaborn as sns
diamonds = sns.load_dataset('diamonds')

abc = diamonds.loc._get_slice_axis(slice(0,len(diamonds)))
abc.__getitem__(['carat','cut','color','price']).head()

   carat      cut color  price
0   0.23    Ideal     E    326
1   0.21  Premium     E    326
2   0.23     Good     E    327
3   0.29  Premium     I    334
4   0.31     Good     J    335

In [3]:
set_i = diamonds.set_index('color')
set_i.head()

       carat      cut clarity  depth  table  price     x     y     z
color
E       0.23    Ideal     SI2   61.5   55.0    326  3.95  3.98  2.43
E       0.21  Premium     SI1   59.8   61.0    326  3.89  3.84  2.31
E       0.23     Good     VS1   56.9   65.0    327  4.05  4.07  2.31
I       0.29  Premium     VS2   62.4   58.0    334  4.20  4.23  2.63
J       0.31     Good     SI2   63.3   58.0    335  4.34  4.35  2.75

In [4]:
try :
    set_i.loc['E':'F']
except ValueError as e :
    print('ValueError', e)
except KeyError as e :
    print('KeyError', e)

KeyError "Cannot get left slice bound for non-unique label: 'E'"

In [8]:
set_i.sort_index(inplace=True)
try :
    set_i_str = set_i.loc['E':'F']
except ValueError as e :
    print('ValueError', e)
except KeyError as e :
    print('KeyError', e)

set_i_str.shape

(19339, 9)

In [9]:
set_i_str.head()

       carat        cut clarity  depth  table  price     x     y     z
color
E       2.01      Ideal     SI2   62.2   57.0  17849  8.09  8.04  5.02
E       1.51  Very Good    VVS2   60.2   61.0  17689  7.34  7.40  4.44
E       0.50      Ideal    VVS2   61.5   57.0   2236  5.09  5.12  3.14
E       1.13      Ideal    VVS1   60.6   57.0  14525  6.72  6.77  4.09
E       1.51      Ideal     VS2   62.7   57.0  14482  7.31  7.26  4.57

In [10]:
set_i_str.tail()

       carat      cut clarity  depth  table  price     x     y     z
color
F       1.01    Ideal     VS1   62.5   54.0   7602  6.46  6.43  4.03
F       1.01  Premium     VS1   62.5   58.0   7602  6.42  6.37  4.00
F       1.05    Ideal     VS2   59.1   57.0   7697  6.67  6.66  3.94
F       1.01     Good     VS2   57.3   62.0   5487  6.63  6.59  3.79
F       1.52    Ideal     SI1   62.0   54.0  12071  7.36  7.44  4.59

In [17]:
import pandas as pd
movies = pd.read_csv("C:/Users/04869/AppData/Roaming/Microsoft/Windows/Start Menu/Programs/Anaconda3 (64-bit)/movies.csv")

In [18]:
movies.head()

,Film,Genre,Lead Studio,Audience score %,Profitability,Rotten Tomatoes %,Worldwide Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008

In [27]:
movies['has_seen'] = 0

In [28]:
movies.head()

,Film,Genre,Lead Studio,Audience score %,Profitability,Rotten Tomatoes %,Worldwide Gross,Year,has_seen
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008,0
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010,0
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010,0
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010,0
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008,0

In [30]:
movies.columns

Index(['Film', 'Genre', 'Lead Studio', 'Audience score %', 'Profitability',
       'Rotten Tomatoes %', 'Worldwide Gross', 'Year', 'has_seen'],
      dtype='object')

In [31]:
movies['has_seen'] = (movies['Audience score %'] + movies['Rotten Tomatoes %']) // 2
movies.head()

,Film,Genre,Lead Studio,Audience score %,Profitability,Rotten Tomatoes %,Worldwide Gross,Year,has_seen
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008,67
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010,60
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010,39
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010,29
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008,50

In [3]:
import os
os.getcwd()

'C:\\Users\\04869\\Downloads\\Pandas Study'

In [16]:
import pandas as pd
os.path.relpath( "c:\\csv" )

'..\\..\\..\\..\\csv'

In [17]:
movies_a = pd.read_csv("movies.csv")

In [18]:
movies_a.head()

,Film,Genre,Lead Studio,Audience score %,Profitability,Rotten Tomatoes %,Worldwide Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008